Revit 2026 API

# StructuralSectionGeneralUFlangeToeOfFillet Property

---

Detailing distance from center of web to flange toe of fillet, in. (mm)

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FlangeToeOfFillet { get; set; }
```
```vb
Public Property FlangeToeOfFillet As Double
	Get
	Set
```
```cpp
public:
property double FlangeToeOfFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member FlangeToeOfFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralU Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace